app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    user = User.where(:provider => auth['provider'],
                      :uid => auth['uid'].to_s).first || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("provider", "uid", "name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["provider", "twitter"], ["uid", "18550567"], ["name", "sandeep123"], ["email", ""], ["created_at", "2015-03-05 02:58:10.620018"], ["updated_at", "2015-03-05 02:58:10.620018"]]
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["provider", "twitter"], ["uid", "18550567"]]